DataProcessors/КСУ_ОбменОргсхемами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>КСУ_ОбменОргсхемами</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ИА_ДанныеФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ДанныеФизЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФотоАватар</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ОргСхема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ОргСхема</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязанности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТерминала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипТерминалаОргСхемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шрифт</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоднятьВверх</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВСхеме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляОргсхемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСтатистик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_НастройкиРабочегоСтолаСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотографии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЗаголовка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЦКП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОЗаполненииСтатистик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_УведомленияОЗаполненииСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВложеннаяОргсхема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаВложеннуюОргсхему</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДолжности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Статистики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статистика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/КСУ_ОбменОргсхемами/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция ВыгрузитьНаСервере()
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОргСхема.Ссылка КАК Ссылка,
	               |	ОргСхема.Наименование,
	               |	ОргСхема.ЭтоГруппа,
	               |	ОргСхема.Ширина,
	               |	ОргСхема.Высота,
	               |	ОргСхема.ЦКП,
	               |	ОргСхема.Обязанности,
	               |	ОргСхема.ТипТерминала,
	               |	ОргСхема.ЦветФона,
	               |	ОргСхема.Шрифт,
	               |	ОргСхема.ПоднятьВверх,
	               |	ОргСхема.ПорядокВСхеме,
	               |	ОргСхема.НаименованиеДляОргсхемы,
	               |	ОргСхема.ВысотаЗаголовка,
	               |	ОргСхема.ВысотаЦКП,
	               |	ОргСхема.КраткоеНаименование,
	               |	ОргСхема.ЭтоВложеннаяОргсхема,
	               |	ОргСхема.Сотрудники.(
	               |		ФизЛицо.Наименование
	               |	),
	               |	ОргСхема.Фотографии
	               |ИЗ
	               |	Справочник.ОргСхема КАК ОргСхема
	               |ГДЕ
	               |	ОргСхема.Ссылка В ИЕРАРХИИ(&Ссылка)
	               |	И ОргСхема.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("Ссылка",Организация);
	дер = запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ДанныеФизЛиц.Фото,
	               |	ИА_ДанныеФизЛиц.ФизЛицо.Наименование
	               |ИЗ
	               |	РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц";
	фото = Запрос.Выполнить().Выгрузить();
	
	РезСтр = ЗначениеВСтрокуВнутр(Новый структура("дерево, фото",дер,фото));
	
	имявр = ПолучитьИмяВременногоФайла("txt");
	
	тд = новый ТекстовыйДокумент;
	тд.УстановитьТекст(РезСтр);
	тд.Записать(имявр);
	
	уид = ПоместитьВоВременноеХранилище(новый ДвоичныеДанные(имявр));

	УдалитьФайлы(имявр);
	возврат уид;
КонецФункции

&НаКлиенте
Процедура Выгрузить(Команда)
	уид = ВыгрузитьНаСервере();
	
	ПолучитьФайл(уид, "os.txt", Истина)
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОргсхемуНаСервере(Адрес, ВыбранноеИмяФайла)
	имявр = ПолучитьИмяВременногоФайла("txt");
	дд = ПолучитьИзВременногоХранилища(Адрес);
	дд.записать(имявр);
	
	тд = новый ТекстовыйДокумент;
	тд.Прочитать(имявр);
	
	Структ = ЗначениеИзСтрокиВнутр(тд.ПолучитьТекст());
	значДер = Структ.дерево;
	ИмяНовойОргсхемы = СокрЛП(ИмяНовойОргсхемы);
	
	ссылкаНаорг = Неопределено;
	Если ЗначениеЗаполнено(ЗаменитьОргсхему) Тогда
		ссылкаНаорг = ЗаменитьОргсхему;
		
		Выборка = Справочники.ОргСхема.Выбрать(ЗаменитьОргсхему);
		Пока выборка.Следующий() Цикл
			об = выборка.ПолучитьОбъект();
			об.УстановитьПометкуУдаления(истина, истина);
		КонецЦикла;
	Иначе		
		НовОрг = Справочники.ОргСхема.СоздатьГруппу();
		ЗаполнитьЗначенияСвойств(НовОрг,значДер.Строки[0],,"Сотрудники");
		Если ИмяНовойОргсхемы<>"" Тогда
			НовОрг.Наименование = ИмяНовойОргсхемы;
			НовОрг.НаименованиеДляОргсхемы = ИмяНовойОргсхемы;
		КонецЕсли;
		НовОрг.ОбменДанными.Загрузка = истина;
		НовОрг.Записать();
		ссылкаНаорг = НовОрг.Ссылка; 
	КонецЕсли;
	
	ЗагрузитьДерево(значДер.Строки[0].Строки,ссылкаНаорг);
	
	Для каждого стр из Структ.Фото Цикл
		сокрНаим = СокрЛП(стр.ФизЛицоНаименование);
		Если сокрНаим<>"" Тогда 
			фото =  Неопределено;
			Если ЗначениеЗаполнено(стр.Фото) и ЗначениеЗаполнено(стр.Фото.Получить()) Тогда
				фото = стр.Фото.Получить();
			КонецЕсли;
			
			сущСотр = Справочники.ФизическиеЛица.НайтиПоНаименованию(сокрНаим,истина);
			
			мен = РегистрыСведений.ИА_ДанныеФизЛиц.СоздатьМенеджерЗаписи();
			мен.ФизЛицо = сущСотр;
			мен.Прочитать();
			
			Если (не ЗначениеЗаполнено(мен.Фото)) или (не ЗначениеЗаполнено(мен.фото.Получить())) ИЛИ ЗамещатьФотоСуществующихСотрудников Тогда
				мен.фото = стр.Фото;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДерево(СтрокиДер, ТекРод)
	для каждого стр из СтрокиДер Цикл
		НовЭл = Справочники.ОргСхема.СоздатьГруппу();
		ЗаполнитьЗначенияСвойств(НовЭл,стр,,"Сотрудники");
		НовЭл.Родитель = ТекРод;
		
		Для каждого стрСотрНаим из стр.Сотрудники Цикл
			сокрНаим = СокрЛП(стрСотрНаим.ФизЛицоНаименование);
			сущСотр = Справочники.ФизическиеЛица.НайтиПоНаименованию(сокрНаим,истина);
			
			Если сущСотр.Пустая() Тогда
				новсотр = Справочники.ФизическиеЛица.СоздатьЭлемент();
				новсотр.Родитель = Константы.КСУ_ГруппаФизЛицДляНовыхОргсхем.Получить();
				новсотр.Наименование = сокрНаим;
				новсотр.Записать();
				сущСотр = новсотр.Ссылка;
			КонецЕсли;
			
			НовСтроСотр = НовЭл.Сотрудники.Добавить();
			НовСтроСотр.ФизЛицо = сущСотр;
		КонецЦикла;
		
		НовЭл.ОбменДанными.Загрузка = истина;
		НовЭл.Записать();
		
		ЗагрузитьДерево(стр.Строки,НовЭл.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОргсхему(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПрочитатьПравилаОбменаЗавершение", ЭтотОбъект);
	АдресФайлаПравилВХранилище = "";
	НачатьПомещениеФайла(ОписаниеОповещения, АдресФайлаПравилВХранилище,Нстр("ru = 'Файл с оргсхемой'"),, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьПравилаОбменаЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		
		АдресФайлаПравилВХранилище = Адрес;
		
		ЗагрузитьОргсхемуНаСервере(Адрес, ВыбранноеИмяФайла);		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаменитьОргсхемуПриИзмененииНаСервере()
	Если ИмяНовойОргсхемы = "" тогда
		ИмяНовойОргсхемы = ЗаменитьОргсхему.Наименование;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьОргсхемуПриИзменении(Элемент)
	ЗаменитьОргсхемуПриИзмененииНаСервере();
КонецПроцедуры
